Revit 2027 API
DuctPressureDropData.Roughness Property
 The roughness of the duct. Units: (ft).
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double Roughness { get; }
Public ReadOnly Property Roughness As Double
	Get
public:
property double Roughness {
	double get ();
}
member Roughness : float with get
Property Value
Double
See Also
Reference
DuctPressureDropData Class
Autodesk.Revit.DB.Mechanical Namespace